Catalogs/ИА_Определения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ИА_Определения</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Определение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Вложения</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Склонения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Слово</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>КодыРаспределения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КодРаспределения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ОргСхема</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/ИА_Определения/Forms/ФормаЭлементаУправляемая/Ext/Form/Module.bsl
&НаКлиенте
Процедура ЗаполнитьСклонения(Команда)
	
	#Если Не ВебКлиент Тогда
	ЗаполнитьСклоненияНаТонкомКлиенте();
	#Иначе
	ЗаполнитьСклоненияНаWebКлиенте();
	#КонецЕсли
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьСклоненияНаWebКлиенте()
	Объект.Склонения.Очистить();
	Для Каждого сл из ПолучитьСтруктуруСклонений_ВебКлиент(Объект.Наименование) Цикл
		Объект.Склонения.Добавить().Слово = сл;
	КонецЦикла;
КонецПроцедуры


&НаКлиенте
Функция ПолучитьСтруктуруСклонений_ВебКлиент(СклоняемаяСтрока)
	
	стрСклонений = Новый Структура;
	Чтение = Новый ЧтениеXML;
	
	мСклонений = Новый Массив;
	//ИмяТемпФайла = ПолучитьИмяВременногоФайла("xml");
	
	Попытка
		Соединение = Новый HTTPСоединение("export.yandex.ru", 80, , , , );
	Исключение
		Возврат стрСклонений;        
	КонецПопытки;
	
	
	Ответ = Соединение.Получить("inflect.xml?name="+СклоняемаяСтрока);//, ИмяТемпФайла);
	Ответ.
	
	
	//Чтение.ОткрытьФайл(ИмяТемпФайла, Новый ПараметрыЧтенияXML(,,,, Истина, Истина,Истина,Истина,Истина));
	Чтение.УстановитьСтроку(Ответ.ПолучитьТелоКакСтроку(), Новый ПараметрыЧтенияXML(,,,, Истина, Истина,Истина,Истина,Истина));
	
	
	Пока Чтение.Прочитать() Цикл
		Если Чтение.Имя = "inflection" и Чтение.ТипУзла = ПредопределенноеЗначение("ТипУзлаXML.НачалоЭлемента") Тогда
			Чтение.Прочитать();
			мСклонений.Добавить(Чтение.Значение);
		КонецЕсли;
		Чтение.Прочитать();
	КонецЦикла;
	
	Чтение.Закрыть();
	
	//УдалитьФайлы(ИмяТемпФайла);
	
	Возврат мСклонений;
	
КонецФункции

&НаКлиенте
Процедура ЗаполнитьСклоненияНаТонкомКлиенте()
		
	Объект.Склонения.Очистить();
	Для Каждого Слово из ПросклонятьСловоНаСервере(Объект.Наименование) Цикл
		Объект.Склонения.Добавить().Слово = Слово;
	КонецЦикла;
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПросклонятьСловоНаСервере(Слово)
	
	Слова = Новый Массив;
	
	Рез = "";
	Для Н = 1 по 6 Цикл
		Если ИА_ОбщиеПроцедуры_Технология_Сервер.Просклонять(Слово, Н, Рез) Тогда;
			Слова.Добавить(Рез);
		КонецЕсли;
	КонецЦикла;
	
	Возврат Слова;
	
КонецФункции

&НаКлиенте
Процедура НаименованиеПриИзменении(Элемент)
	Если Объект.Склонения.Количество() =0 Тогда
		новстр = Объект.Склонения.Добавить();
		новстр.Слово = Объект.Наименование;
	Иначе
		Объект.Склонения[0].Слово = Объект.Наименование;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЭтоКопирование = Ложь;
	ВложенияСтруктура = Новый Структура;
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		
		Если ЗначениеЗаполнено(Параметры.ЗначениеКопирования) Тогда
	         ЭтоКопирование = Истина;
			 ВложенияСтруктура = Параметры.ЗначениеКопирования.Вложения.Получить();
		КонецЕсли;

	КонецЕсли;	
	
	Если Не ЭтоКопирование Тогда
		ВложенияСтруктура = Справочники.ИА_Определения.ПолучитьВложенияОпределения(Объект.Ссылка);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.Определение) Тогда
		
		Если ВложенияСтруктура = Неопределено Тогда
			ВложенияСтруктура = Новый Структура;
		КонецЕсли;
		ФорматДок.УстановитьHTML(Объект.Определение, ВложенияСтруктура);
		
	КонецЕсли;
    
    РолиПользователя          = ПользователиИнформационнойБазы.ТекущийПользователь().Роли; 
    ЕстьПолныеПрава           = РолиПользователя.Содержит(Метаданные.Роли.ПолныеПрава);    
    МожноРедактировать        = ПравоДоступа("Редактирование", Метаданные.Справочники.ИА_Определения);
    
    ВидимостьКнопки = ЕстьПолныеПрава ИЛИ МожноРедактировать;
    
    Элементы.СклоненияЗаполнитьСклонения.Видимость = ВидимостьКнопки;
    
                      
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	струк = Новый Структура;
	ФорматДок.ПолучитьHTML(ТекущийОбъект.Определение, струк);
	ТекущийОбъект.Вложения = Новый ХранилищеЗначения(струк);
КонецПроцедуры


// -- КОНЕЦ
